/*
 * @Author: 0x9DEFA478
 * @Date: 2021-06-04 20:16:16
 * @LastEditTime: 2021-10-24 18:45:22
 * @LastEditors: 0x9DEFA478
 * @Description: 实现说明详见H_ThreadScheduler_Semaphore.c
 * QQ:2652450237
 * ============================================================================================================================================
 * 
 * 
 * 
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * 
 * 
 * 
 * ============================================================================================================================================
 * 
 */
#include "H_ThreadScheduler_Core.h"
#include "..\LL\H_ThreadScheduler_LL.h"

extern H_TS* volatile H_TS_Core;



/**
 * @brief 新建一个信号量
 * @param MaxCount 最大信号量数量(如果为1 则相当于为二值信号量)
 * @return 信号量对象 如果为NULL 则失败
 */
H_TS_Semaphore* new_H_TS_Semaphore(int MaxCount){
  H_TS_Semaphore* r;

  oH_TS_SchedulerSuspend();

  r=H_TS_Core->Memory.Malloc(sizeof(H_TS_Semaphore));
  if(r==NULL){
    oH_TS_ResumeSchedulerAuto();
    return NULL;
  }

  r->Semaphore=H_TS_Semaphore_Create(MaxCount);
  if(r->Semaphore==NULL){
    H_TS_Core->Memory.Free(r);
    oH_TS_ResumeSchedulerAuto();
    return NULL;
  }

  r->Owner=NULL;

  oH_TS_ResumeSchedulerAuto();

  return r;
}

/**
 * @brief 删除一个信号量
 * @param Semaphore 要删除的信号量对象
 * @return 0:成功 -1:有线程因此信号量阻塞
 */
int delete_H_TS_Semaphore(H_TS_Semaphore* Semaphore){

  oH_TS_SchedulerSuspend();

  if(Semaphore->Owner!=NULL){
    oH_TS_ResumeSchedulerAuto();
    return -1;
  }

  H_TS_Semaphore_Delete(Semaphore->Semaphore);
  H_TS_Core->Memory.Free(Semaphore);

  oH_TS_ResumeSchedulerAuto();

  return 0;
}

