/*
 * @Author: 0x9DEFA478
 * @Date: 2021-08-23 22:30:19
 * @LastEditTime: 2021-10-30 23:08:04
 * @LastEditors: 0x9DEFA478
 * @Description: 
 * QQ:2652450237
 * ============================================================================================================================================
 * 
 * 
 * 
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * 
 * 
 * 
 * ============================================================================================================================================
 * 
 */
#ifndef __IP_I2S_H_
#define __IP_I2S_H_
#include "i2s.h"
#include "IP_DMA.h"



//获取发送dma实例
#define cIP_I2S_txDMA(ip_i2s) ((ip_i2s)->Instance.DMA_Tx->Instance.Stream)

//获取接收dma实例
#define cIP_I2S_rxDMA(ip_i2s) ((ip_i2s)->Instance.DMA_Rx->Instance.Stream)

//获取spi实例
#define cIP_I2S_I2S(ip_i2s)   ((ip_i2s)->Instance.I2S)


typedef struct _IP_I2S{

  struct
  {
    SPI_TypeDef* I2S;
    IP_DMA* DMA_Tx;
    IP_DMA* DMA_Rx;
  }Instance;
  

  volatile int I2SDiv;//I2S分频系数
  int SizeOfDataPack;//调用GetData_Callback时每个数据包的大小(单位:字节)

  void* Callback_v;
  void* (*GetData_Callback)(void*);

}IP_I2S;



/**
 * @brief 初始化 IP_I2S 仅发送模式
 * @param ip_i2s 空的IP_I2S对象(已分配内存的)
 * @param DMA_Tx 初始化好的dma对象
 * @param _i2s i2s句柄
 * @return 无
 */
void IP_I2S_TxOnly_Init(IP_I2S* ip_i2s,IP_DMA* DMA_Tx,SPI_TypeDef* _i2s);

/**
 * @brief 开始I2S传输
 * @param ip_i2s IP_I2S句柄
 * @param SizeOfDataPack 每个数据包大小(单位:字节) 必须为4的倍数
 * @param GetData_Callback 获取数据的方法
 * @param Callback_v GetData_Callback传入的参数
 * @return 无
 */
void IP_I2S_TxOnly_Start(IP_I2S* ip_i2s,int SizeOfDataPack,void* (*GetData_Callback)(void*),void* Callback_v);

/**
 * @brief 停止I2S传输
 * @param ip_i2s IP_I2S句柄
 * @return 无
 */
void IP_I2S_TxOnly_Stop(IP_I2S* ip_i2s);

/**
 * @brief 设置I2S分频 在i2s关闭的情况下使用
 * @param ip_i2s IP_I2S句柄
 * @param I2SDiv 分频系数
 * @return 无
 */
void IP_I2S_TxOnly_SetI2SDiv(IP_I2S* ip_i2s,int I2SDiv);


#endif //__IP_I2S_H_
