/*
 * @Author: 0x9DEFA478
 * @Date: 2021-07-30 14:42:17
 * @LastEditTime: 2022-01-14 00:21:24
 * @LastEditors: 0x9DEFA478
 * @Description: SRAM的内存实现(分配)
 * QQ:2652450237
 * ============================================================================================================================================
 * 
 * 
 * 
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * 
 * 
 * 
 * ============================================================================================================================================
 * 
 */
#include "MemoryMalloc.h"
#include "H_ThreadScheduler.h"

static H_TS_Lock* Lock=NULL;

#define vMemoryMalloc_SRAM_Mem_Size 10*1024
__attribute__((aligned(8))) static unsigned char Mem[vMemoryMalloc_SRAM_Mem_Size];




/**
 * @brief 分配
 * @param Size 要分配的内存大小, 单位:字节
 * @return 如果为NULL 则分配失败，返回其他则成功
 */
static void* Malloc(Husize Size){
  void* r;

  H_TS_LockLock(Lock);
  
  r=H_Malloc(Mem,Size);
  
  H_TS_LockUnlock(Lock);
  

  return r;
}

/**
 * @brief 释放内存
 * @param v 要释放的内存的指针
 * @return 无
 */
static void Free(void* v){
  
  H_TS_LockLock(Lock);
  
  H_Free(Mem,v);
  
  H_TS_LockUnlock(Lock);
  
}

/**
 * @brief 内存信息获取
 * @param info 用于返回信息
 * @return 无
 */
static void GetInfo(H_Malloc_Info* info){
  
  H_TS_LockLock(Lock);
  
  H_Malloc_GetInfo(Mem,info);
  
  H_TS_LockUnlock(Lock);
  
}

/**
 * @brief 内存初始化
 * @return 无
 */
void MemoryMalloc_SRAM_Init(){

  H_Malloc_Init(Mem,vMemoryMalloc_SRAM_Mem_Size,3);

  Lock=new_H_TS_Lock();
  
}

const H_MemoryMalloc MemoryMalloc_SRAM={
  .Malloc=Malloc,
  .Free=Free,
  .GetInfo=GetInfo
};
