/*
 * @Author: 0x9DEFA478
 * @Date: 2021-07-24 18:15:31
 * @LastEditTime: 2021-12-12 21:15:50
 * @LastEditors: 0x9DEFA478
 * @Description: 
 * QQ:2652450237
 * ============================================================================================================================================
 * 
 * 
 * 
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * 
 * 
 * 
 * ============================================================================================================================================
 * 
 */
#ifndef __H_Graphics_H_
#define __H_Graphics_H_
#include "H_Type.h"


#define vH_Graphics_isBigend 0

//位图定义
typedef struct{
  
  void* Bitmap;

  //宽度 单位:像素
  int Width;

  //高度 单位:像素
  int Height;

}H_Graphics_Bitmap;

//区域参数定义
typedef struct{

  //源位图
  H_Graphics_Bitmap* S;
  //目标位图
  H_Graphics_Bitmap* D;

  //源 x坐标 单位:像素
  int sX;
  //源 y坐标 单位:像素
  int sY;

  //目标 x坐标 单位:像素
  int dX;
  //目标 y坐标 单位:像素
  int dY;

  //操作宽度 单位:像素
  int Width;

  //操作高度 单位:像素
  int Height;

}H_Graphics_Area_Param;


/**
 * @brief 图形复制 低位靠近原点垂直分布 转 低位靠近原点垂直分布 (OLED)
 * @param Param 操作的参数
 * @return 无
 */
void H_Graphics_L1Vertical_CopyTo_L1Vertical(H_Graphics_Area_Param* Param);

/**
 * @brief 图形复制 低位靠近原点垂直分布 转 低位靠近原点垂直分布 反色 (OLED)
 * @param Param 操作的参数
 * @return 无
 */
void H_Graphics_L1Vertical_CopyTo_L1Vertical_Reverse(H_Graphics_Area_Param* Param);

/**
 * @brief 填充颜色 低位靠近原点垂直分布
 * @param bitmap 要填充的位图
 * @param Color 颜色 0:黑色 其他:白色
 * @param X 坐标X
 * @param Y 坐标Y
 * @param Width 宽度
 * @param Height 高度
 * @return 无
 */
void H_Graphics_L1Vertical_Fill(H_Graphics_Bitmap* bitmap,int Color,int X,int Y,int Width,int Height);




#endif //__H_Graphics_H_
