/*
 * @Author: 0x9DEFA478
 * @Date: 2021-03-11 17:53:34
 * @LastEditTime: 2021-11-27 23:17:33
 * @LastEditors: 0x9DEFA478
 * @Description: 
 * ============================================================================================================================================
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * ============================================================================================================================================
 * 
 */
#ifndef __H_Lib_H_
#define __H_Lib_H_


#define H_String_ByteType                                          unsigned char
#define H_String_8BitCharType                                      char
#define H_String_16BitCharType                                     unsigned short

/**
 * @brief 格式化字符串到字节数组
 * @param Buffer 所使用的缓存
 * @param Format 格式
 * {i} {I} 整型(int) {iyyy} {Iyyy} yyy为10进制数字 表示最短长度(yyy长度任意 负数代表左对齐)
 * {X} {x} 16进制(unsigned int){xyyy} {Xyyy} yyy为10进制数字 表示最短长度(yyy长度任意) 
 * {Diyyy} {dxyyy} {i},{I},{x},{X}的长整型模式
 * {f} {F} 浮点数(double) {Fyyy.xxx} {fyyy.xxx} {F.xxx} {f.xxx} yyy为10进制数字, 为总字符最小长度,负数代表左对齐. xxx为10进制数字, 保留小数位数
 * {e} {E} 浮点数(double) 科学计数法 {eyyy.xxx} {Eyyy.xxx} yyy为10进制数字, 为总字符最小长度,负数代表左对齐. xxx为10进制数字, 保留小数位数
 * {s} {S} 以'\0'结尾的字符串
 * @param ... 参数
 * @return 生成的字符串长度, 这个长度不包括结束符
 */
int H_StringFormat(void* Buffer,H_String_8BitCharType* Format,...);

/**
 * @brief 格式化字符串到字节数组
 * @param Buffer 所使用的缓存
 * @param Format 格式 与sprintf()的格式化字符串一致
 * @param ... 参数
 * @return 生成的字符串长度, 这个长度不包括结束符
 */
int H_sprintf(void* Buffer,H_String_8BitCharType* Format,...);

/**
 * @brief 获取字符串长度
 * @param string 字符串
 * @return 字符串长度
 */
int H_StringGetLength(H_String_8BitCharType* Str);

/**
 * @brief 复制字符串到数组
 * @param dst 要复制到的数组
 * @param string 字符串
 * @return 无
 */
void H_StringCopy(H_String_ByteType* Dst,H_String_8BitCharType* Str);

/**
 * @brief UTF8解析方法 每次调用将获取到一个unicode 并且将字符串指针向后移动一个字符
 * @param StringPtr 指向一个字符串指针
 * @param unicode 用于返回unicode
 * @return 如果不为0, 代表解析出错 一般由字符串不合法引发
 */
int H_UTF8_Decode(H_String_8BitCharType** StringPtr,H_String_16BitCharType* unicode);



#endif // !__H_Lib_H_
