/*
 * @Author: 0x9DEFA478
 * @Date: 2021-07-26 19:00:49
 * @LastEditTime: 2021-07-26 22:43:04
 * @LastEditors: 0x9DEFA478
 * @Description: 
 * QQ:2652450237
 * ============================================================================================================================================
 * 
 * 
 * 
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * 
 * 
 * 
 * ============================================================================================================================================
 * 
 */
#ifndef __IP_PLL_H_
#define __IP_PLL_H_



/**
 * @brief 使能或关闭PLL
 * @param Status 0:关闭PLL 其他:打开PLL
 * @return 无
 */
void PLL_SetStatus(unsigned int Status);

/**
 * @brief 使能或关闭PLLI2S
 * @param Status 0:关闭PLL 其他:打开PLL
 * @return 无
 */
void PLLI2S_SetStatus(unsigned int Status);

/**
 * @brief 使能或关闭PLLSAI
 * @param Status 0:关闭PLL 其他:打开PLL
 * @return 无
 */
void PLLSAI_SetStatus(unsigned int Status);

/**
 * @brief 配置PLL 应该在PLL失能的情况下使用该方法
 *        需要提供PLL参考时钟频率 以进行频率范围配置
 * @param pllm 预分频m 2~63
 * @param plln 倍频系数n 50~432
 * @param pllp 输出p的分频系数 只可取2,4,6,8
 * @param pllq 输出q的分频系数 2~15
 * @param pllr 输出r的分频系数 无效
 * @return 无
 */
void PLL_SetDIV(unsigned int pllm,unsigned int plln,unsigned int pllp,unsigned int pllq,unsigned int pllr);

/**
 * @brief 配置PLLI2S 应该在PLLI2S失能的情况下使用该方法
 *        需要提供PLL参考时钟频率 以进行频率范围配置
 * @param plln 倍频系数n 50~432
 * @param pllp 输出p的分频系数 无效
 * @param pllq 输出q的分频系数 2~15
 * @param pllr 输出r的分频系数 2~7
 * @param divq 输出q的再分频系数 1~32
 * @return 无
 */
void PLLI2S_SetDIV(unsigned int plln,unsigned int pllp,unsigned int pllq,unsigned int pllr,unsigned int divq);

/**
 * @brief 配置PLLSAI 应该在PLLSAI失能的情况下使用该方法
 *        需要提供PLL参考时钟频率 以进行频率范围配置
 * @param plln 倍频系数n
 * @param pllp 输出p的分频系数 只可取2,4,6,8
 * @param pllq 输出q的分频系数 2~15
 * @param pllr 输出r的分频系数 无效
 * @param divq 输出q的再分频系数 1~32
 * @return 无
 */
void PLLSAI_SetDIV(unsigned int plln,unsigned int pllp,unsigned int pllq,unsigned int pllr,unsigned int divq);


#endif //__IP_PLL_H_
