/*
 * @Author: 0x9DEFA478
 * @Date: 2021-08-21 19:58:33
 * @LastEditTime: 2022-01-13 20:04:40
 * @LastEditors: 0x9DEFA478
 * @Description: 
 * QQ:2652450237
 * ============================================================================================================================================
 * 
 * 
 * 
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * 
 * 
 * 
 * ============================================================================================================================================
 * 
 */
#include "./H_ThreadScheduler_LL.h"
#include "../API/H_ThreadScheduler_Core.h"




extern H_TS* H_TS_Core;




extern void* H_TS_StartFirstThread;//在 LL_ASM中




extern void* volatile * volatile H_TS_RunThread;
extern void* H_TS_ScheduleISR_Call;




/**
 * @brief 设置Tick回调 并且使能
 * 根据平台修改
 * @param callback 使能Tick回调
 * @param v 回调传入参数
 * @return 无
 */
void H_TS_EnableTickCallback(void (*callback)(void*),void* v){
  //该方法在开始调度时被调用
  //在这里将callback设置为Tick回调 使得每次Tick中断callback都会被调用一次

  TimeTick_Set_IRQ_Callback(callback,v);//Tick回调设置
}

/**
 * @brief 底层初始化
 * 根据平台修改
 * @return 无
 */
void H_TS_LL_Init(){
  //该方法在开始调度时被调用

  //设置并启用软件中断 并且优先级设置为最低
  eclic_set_irq_lvl_abs(CLIC_INT_SFT,0U);
  eclic_set_irq_priority(CLIC_INT_SFT,0U);
  eclic_set_vmode(CLIC_INT_SFT);//软件启用向量模式 使得中断能够选择要返回到的上下文
  eclic_set_level_trig(CLIC_INT_SFT);
  eclic_enable_interrupt(CLIC_INT_SFT);

  //线程相关指针配置
  H_TS_ScheduleISR_Call=(void*)&H_TS_StartFirstThread;//PendSV调用设置为H_TS_StartFirstThread
  H_TS_RunThread=H_TS_Core->ReadyThreads->StackPointer;
  H_TS_Core->RunThreadPtr=(void*)&H_TS_RunThread;
  
}



