/*
 * @Author: 0x9DEFA478
 * @Date: 2021-06-01 21:37:17
 * @LastEditTime: 2021-10-24 21:54:07
 * @LastEditors: 0x9DEFA478
 * @Description: H_ThreadScheduler配置文件
 * QQ:2652450237
 * ============================================================================================================================================
 * 
 * 
 * 
 *                                                                                               ************      ****************************
 *                                                                                             ************      ****************************  
 *                                                                                           ************      ****************************    
 *                                                                                         ************      ****************************      
 *                                                                                       ************      ************                        
 *                                                                                     ************      ************                          
 *                                                                                   ************      ************                            
 *                                                                                 ************      ************                              
 *                                                                               ************      ************                                
 *                                                                             ************      ************                                  
 *                                                                           ************      ************                                    
 *                                                                         ************      ************                                      
 *                                                                       ************      ************                                        
 *                                                                     ************      ************                                          
 *                                                                   ************      ************                                            
 *                                                                 ************      ************                                              
 *                                                               ************      ************                                                
 *                                                             ************      ************                                                  
 *                                                           ************      ************                                                    
 *                                                         ************      ************                                                      
 *                                                       ************      ************                                                        
 *                                                     ************      ************                                                          
 *                                                   ************      ************                                                            
 *                                                 ************      ************                                                              
 *                                               ************      ************                                                                
 *                                             ************      ************                                                                  
 *                                           ************      ************                                                                    
 *                                         ************      ************                                                                      
 *                                       ************      ************                                                                        
 *                                     ************      ************                                                                          
 *                                   ************      ************                                                                            
 *                                 ************      ************                                                                              
 *                               ************      ************                                                                                
 *                             ************      ************                                                                                  
 *                           ************      ************                                                                                    
 *                         ************      ************                                                                                      
 *       ****************************      ************                                                                                        
 *     ****************************      ************                                                                                          
 *   ****************************      ************                                                                                            
 * ****************************      ************                                                                                              
 * 
 * 
 * 
 * ============================================================================================================================================
 * 
 */
#ifndef __H_ThreadScheduler_Config_H_
#define __H_ThreadScheduler_Config_H_
#include "H_Type.h"


//用户头文件
#define iH_TS_UserInclude                    "Peripheral.h"


//tick计数使用的类型
typedef Hint32 H_TS_Tick;

//最底优先级 32位有符号整型最大值为 0x7FFFFFFF
#define vH_TS_ThreadMaxPriorityValue         0x7FFFFFFF

//堆栈指针增长方向 0:地址减少方向 其他:地址增加方向
#define vH_TS_StackPtrDirection              0

//指针最大值 (不能为0)
#define vH_TS_VoidPtrMaxValue                ((void*)0xFFFFFFFFU)


//是否使能堆栈占用统计 0:关闭 其他:开启
#define vH_TS_isEnableStackUsageStatistics   1

//阻塞链表数 设置为 sqrt(阻塞任务数) 为最佳 (实际上阻塞任务随着程序运行是不定的 根据实际情况确定)
#define vH_TS_BlockThreadListNum             4

//是否保存线程返回值(线程中使用return结束线程才会有返回值)
#define vH_TS_isStoreThreadRetVal            1

//是否使用线程句柄内部的线程名字段
#define vH_TS_isUseThreadName                1

//是否使用CPU使用率统计 0:关闭 其他:开启
#define vH_TS_isEnableCPULoadCalculate       1

//如果使能了CPU占用率统计(通过vH_TS_isEnableCPULoadCalculate来设置) 该段表示每运行多少时间后更新CPU占用值(时间由H_TS_GetDT()来提供)
#define vH_TS_CPULoad_T                      400000


#endif //__H_ThreadScheduler_Config_H_
